# Terraform environment test
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1mMDNmNzU3OS01ZjM5LTRkN2YtYmNlYS04ZTVjYjZkN2FjYTQ7b2JqZWN0SWQ9MDJiMTdkMjgtN2VjOC00MDg0LTkyY2UtZDI2MDUxZmE0OTk4O3N1YnNjcmlwdGlvbklkPTFjZThlOWFmLWMyZDYtNDRlNy05YzVlLTA5OWEzMDgwNTZmZTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_monitor_data_collection_endpoint.k6tests: Reading...
data.azurerm_monitor_data_collection_endpoint.k6tests: Read complete after 1s [id=/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MA_k6tests-amw-F7sT_norwayeast_managed/providers/Microsoft.Insights/dataCollectionEndpoints/k6tests-amw-F7sT]
data.azurerm_kubernetes_cluster.k6tests: Reading...
data.azurerm_monitor_data_collection_rule.k6tests: Reading...
data.azurerm_monitor_data_collection_rule.k6tests: Read complete after 1s [id=/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg-F7sT/providers/Microsoft.Insights/dataCollectionRules/k6tests-dcr-F7sT]
data.azurerm_kubernetes_cluster.k6tests: Read complete after 3s [id=/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg-F7sT/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster-F7sT]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.services.kubernetes_config_map_v1.deploy_environment_at22["authentication"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_at22" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://at22.altinn.cloud"
          + "BASE_URL"         = "https://platform.at22.altinn.cloud"
          + "DEPLOY_ENV"       = "at22"
          + "ENV_TYPE"         = "dev"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at22"
          + namespace        = "authentication"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environment_at22["core"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_at22" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://at22.altinn.cloud"
          + "BASE_URL"         = "https://platform.at22.altinn.cloud"
          + "DEPLOY_ENV"       = "at22"
          + "ENV_TYPE"         = "dev"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at22"
          + namespace        = "core"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environment_at22["correspondence"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_at22" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://at22.altinn.cloud"
          + "BASE_URL"         = "https://platform.at22.altinn.cloud"
          + "DEPLOY_ENV"       = "at22"
          + "ENV_TYPE"         = "dev"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at22"
          + namespace        = "correspondence"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environment_at22["dialogporten"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_at22" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://at22.altinn.cloud"
          + "BASE_URL"         = "https://platform.at22.altinn.cloud"
          + "DEPLOY_ENV"       = "at22"
          + "ENV_TYPE"         = "dev"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at22"
          + namespace        = "dialogporten"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environment_at22["platform"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_at22" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://at22.altinn.cloud"
          + "BASE_URL"         = "https://platform.at22.altinn.cloud"
          + "DEPLOY_ENV"       = "at22"
          + "ENV_TYPE"         = "dev"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at22"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environment_at23["authentication"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_at23" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://at23.altinn.cloud"
          + "BASE_URL"         = "https://platform.at23.altinn.cloud"
          + "DEPLOY_ENV"       = "at23"
          + "ENV_TYPE"         = "dev"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at23"
          + namespace        = "authentication"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environment_at23["core"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_at23" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://at23.altinn.cloud"
          + "BASE_URL"         = "https://platform.at23.altinn.cloud"
          + "DEPLOY_ENV"       = "at23"
          + "ENV_TYPE"         = "dev"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at23"
          + namespace        = "core"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environment_at23["correspondence"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_at23" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://at23.altinn.cloud"
          + "BASE_URL"         = "https://platform.at23.altinn.cloud"
          + "DEPLOY_ENV"       = "at23"
          + "ENV_TYPE"         = "dev"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at23"
          + namespace        = "correspondence"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environment_at23["dialogporten"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_at23" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://at23.altinn.cloud"
          + "BASE_URL"         = "https://platform.at23.altinn.cloud"
          + "DEPLOY_ENV"       = "at23"
          + "ENV_TYPE"         = "dev"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at23"
          + namespace        = "dialogporten"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environment_at23["platform"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_at23" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://at23.altinn.cloud"
          + "BASE_URL"         = "https://platform.at23.altinn.cloud"
          + "DEPLOY_ENV"       = "at23"
          + "ENV_TYPE"         = "dev"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at23"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environment_at24["authentication"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_at24" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://at24.altinn.cloud"
          + "BASE_URL"         = "https://platform.at24.altinn.cloud"
          + "DEPLOY_ENV"       = "at24"
          + "ENV_TYPE"         = "dev"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at24"
          + namespace        = "authentication"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environment_at24["core"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_at24" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://at24.altinn.cloud"
          + "BASE_URL"         = "https://platform.at24.altinn.cloud"
          + "DEPLOY_ENV"       = "at24"
          + "ENV_TYPE"         = "dev"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at24"
          + namespace        = "core"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environment_at24["correspondence"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_at24" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://at24.altinn.cloud"
          + "BASE_URL"         = "https://platform.at24.altinn.cloud"
          + "DEPLOY_ENV"       = "at24"
          + "ENV_TYPE"         = "dev"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at24"
          + namespace        = "correspondence"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environment_at24["dialogporten"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_at24" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://at24.altinn.cloud"
          + "BASE_URL"         = "https://platform.at24.altinn.cloud"
          + "DEPLOY_ENV"       = "at24"
          + "ENV_TYPE"         = "dev"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at24"
          + namespace        = "dialogporten"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environment_at24["platform"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_at24" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://at24.altinn.cloud"
          + "BASE_URL"         = "https://platform.at24.altinn.cloud"
          + "DEPLOY_ENV"       = "at24"
          + "ENV_TYPE"         = "dev"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-at24"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environment_prod["authentication"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_prod" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://altinn.no/"
          + "BASE_URL"         = "https://platform.altinn.no"
          + "DEPLOY_ENV"       = "prod"
          + "ENV_TYPE"         = "prod"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-prod"
          + namespace        = "authentication"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environment_prod["core"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_prod" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://altinn.no/"
          + "BASE_URL"         = "https://platform.altinn.no"
          + "DEPLOY_ENV"       = "prod"
          + "ENV_TYPE"         = "prod"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-prod"
          + namespace        = "core"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environment_prod["correspondence"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_prod" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://altinn.no/"
          + "BASE_URL"         = "https://platform.altinn.no"
          + "DEPLOY_ENV"       = "prod"
          + "ENV_TYPE"         = "prod"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-prod"
          + namespace        = "correspondence"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environment_prod["dialogporten"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_prod" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://altinn.no/"
          + "BASE_URL"         = "https://platform.altinn.no"
          + "DEPLOY_ENV"       = "prod"
          + "ENV_TYPE"         = "prod"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-prod"
          + namespace        = "dialogporten"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environment_prod["platform"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_prod" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://altinn.no/"
          + "BASE_URL"         = "https://platform.altinn.no"
          + "DEPLOY_ENV"       = "prod"
          + "ENV_TYPE"         = "prod"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-prod"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environment_tt02["authentication"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_tt02" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://tt02.altinn.no/"
          + "BASE_URL"         = "https://platform.tt02.altinn.no"
          + "DEPLOY_ENV"       = "tt02"
          + "ENV_TYPE"         = "staging"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-tt02"
          + namespace        = "authentication"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environment_tt02["core"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_tt02" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://tt02.altinn.no/"
          + "BASE_URL"         = "https://platform.tt02.altinn.no"
          + "DEPLOY_ENV"       = "tt02"
          + "ENV_TYPE"         = "staging"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-tt02"
          + namespace        = "core"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environment_tt02["correspondence"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_tt02" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://tt02.altinn.no/"
          + "BASE_URL"         = "https://platform.tt02.altinn.no"
          + "DEPLOY_ENV"       = "tt02"
          + "ENV_TYPE"         = "staging"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-tt02"
          + namespace        = "correspondence"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environment_tt02["dialogporten"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_tt02" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://tt02.altinn.no/"
          + "BASE_URL"         = "https://platform.tt02.altinn.no"
          + "DEPLOY_ENV"       = "tt02"
          + "ENV_TYPE"         = "staging"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-tt02"
          + namespace        = "dialogporten"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environment_tt02["platform"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_tt02" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://tt02.altinn.no/"
          + "BASE_URL"         = "https://platform.tt02.altinn.no"
          + "DEPLOY_ENV"       = "tt02"
          + "ENV_TYPE"         = "staging"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-tt02"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environment_yt01["authentication"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_yt01" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://yt01.altinn.cloud"
          + "BASE_URL"         = "https://platform.yt01.altinn.cloud"
          + "DEPLOY_ENV"       = "yt01"
          + "ENV_TYPE"         = "perf"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-yt01"
          + namespace        = "authentication"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environment_yt01["core"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_yt01" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://yt01.altinn.cloud"
          + "BASE_URL"         = "https://platform.yt01.altinn.cloud"
          + "DEPLOY_ENV"       = "yt01"
          + "ENV_TYPE"         = "perf"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-yt01"
          + namespace        = "core"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environment_yt01["correspondence"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_yt01" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://yt01.altinn.cloud"
          + "BASE_URL"         = "https://platform.yt01.altinn.cloud"
          + "DEPLOY_ENV"       = "yt01"
          + "ENV_TYPE"         = "perf"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-yt01"
          + namespace        = "correspondence"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environment_yt01["dialogporten"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_yt01" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://yt01.altinn.cloud"
          + "BASE_URL"         = "https://platform.yt01.altinn.cloud"
          + "DEPLOY_ENV"       = "yt01"
          + "ENV_TYPE"         = "perf"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-yt01"
          + namespace        = "dialogporten"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environment_yt01["platform"] will be created
  + resource "kubernetes_config_map_v1" "deploy_environment_yt01" {
      + data = {
          + "ALTINN2_BASE_URL" = "https://yt01.altinn.cloud"
          + "BASE_URL"         = "https://platform.yt01.altinn.cloud"
          + "DEPLOY_ENV"       = "yt01"
          + "ENV_TYPE"         = "perf"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "deploy-environments-yt01"
          + namespace        = "platform"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["authentication.at22"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at22.altinn.cloud"
        } -> null
      - id          = "authentication/deploy-environments-at22" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at22" -> null
          - namespace        = "authentication" -> null
          - resource_version = "690774" -> null
          - uid              = "baedd4ec-c5dc-4fbc-a9cd-be46fa764021" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["authentication.at23"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at23.altinn.cloud"
        } -> null
      - id          = "authentication/deploy-environments-at23" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at23" -> null
          - namespace        = "authentication" -> null
          - resource_version = "690797" -> null
          - uid              = "fe77742c-8ae1-420c-bff2-b8a3548f7e28" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["authentication.at24"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at24.altinn.cloud"
        } -> null
      - id          = "authentication/deploy-environments-at24" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at24" -> null
          - namespace        = "authentication" -> null
          - resource_version = "690759" -> null
          - uid              = "8fc5013d-a470-456c-822f-0d862d17be48" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["authentication.prod"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.altinn.no"
        } -> null
      - id          = "authentication/deploy-environments-prod" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-prod" -> null
          - namespace        = "authentication" -> null
          - resource_version = "690799" -> null
          - uid              = "f068b013-b2db-49b1-af85-ffd7777db25b" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["authentication.tt02"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.tt02.altinn.no"
        } -> null
      - id          = "authentication/deploy-environments-tt02" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-tt02" -> null
          - namespace        = "authentication" -> null
          - resource_version = "690771" -> null
          - uid              = "431ee52b-f07d-463a-9e5f-2cacbc9a0263" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["authentication.yt01"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.yt01.altinn.cloud"
        } -> null
      - id          = "authentication/deploy-environments-yt01" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-yt01" -> null
          - namespace        = "authentication" -> null
          - resource_version = "690801" -> null
          - uid              = "d363fe9e-ff9c-4ebc-8c06-d63465299e8d" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["core.at22"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at22.altinn.cloud"
        } -> null
      - id          = "core/deploy-environments-at22" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at22" -> null
          - namespace        = "core" -> null
          - resource_version = "690796" -> null
          - uid              = "53799edf-92e8-45f7-a4da-0370c634fcda" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["core.at23"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at23.altinn.cloud"
        } -> null
      - id          = "core/deploy-environments-at23" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at23" -> null
          - namespace        = "core" -> null
          - resource_version = "690775" -> null
          - uid              = "9ed3216b-4dac-427a-9b3c-b6d07115c64c" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["core.at24"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at24.altinn.cloud"
        } -> null
      - id          = "core/deploy-environments-at24" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at24" -> null
          - namespace        = "core" -> null
          - resource_version = "690802" -> null
          - uid              = "a39f1c59-cd21-40a4-b5af-43dfd96c824e" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["core.prod"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.altinn.no"
        } -> null
      - id          = "core/deploy-environments-prod" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-prod" -> null
          - namespace        = "core" -> null
          - resource_version = "690785" -> null
          - uid              = "e5b3569c-c28a-47e4-a2df-2367f278ff47" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["core.tt02"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.tt02.altinn.no"
        } -> null
      - id          = "core/deploy-environments-tt02" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-tt02" -> null
          - namespace        = "core" -> null
          - resource_version = "690798" -> null
          - uid              = "461dde92-cd9c-4ff1-b97c-dc785f5957e1" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["core.yt01"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.yt01.altinn.cloud"
        } -> null
      - id          = "core/deploy-environments-yt01" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-yt01" -> null
          - namespace        = "core" -> null
          - resource_version = "690769" -> null
          - uid              = "dce48c86-b542-41a7-ac22-087bf9a35bd7" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["correspondence.at22"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at22.altinn.cloud"
        } -> null
      - id          = "correspondence/deploy-environments-at22" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at22" -> null
          - namespace        = "correspondence" -> null
          - resource_version = "690772" -> null
          - uid              = "13cac433-1bae-4e46-a715-29432648cba6" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["correspondence.at23"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at23.altinn.cloud"
        } -> null
      - id          = "correspondence/deploy-environments-at23" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at23" -> null
          - namespace        = "correspondence" -> null
          - resource_version = "690783" -> null
          - uid              = "583e4894-43d6-4435-95fa-4c061e1d77d8" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["correspondence.at24"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at24.altinn.cloud"
        } -> null
      - id          = "correspondence/deploy-environments-at24" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at24" -> null
          - namespace        = "correspondence" -> null
          - resource_version = "690766" -> null
          - uid              = "119ba000-ef58-4c90-95b8-adb350de0aef" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["correspondence.prod"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.altinn.no"
        } -> null
      - id          = "correspondence/deploy-environments-prod" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-prod" -> null
          - namespace        = "correspondence" -> null
          - resource_version = "690768" -> null
          - uid              = "8334a6cc-0d79-45c1-b377-db9ac08c2c1b" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["correspondence.tt02"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.tt02.altinn.no"
        } -> null
      - id          = "correspondence/deploy-environments-tt02" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-tt02" -> null
          - namespace        = "correspondence" -> null
          - resource_version = "690776" -> null
          - uid              = "a287a4b9-23f4-474a-b7d7-a7303293f315" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["correspondence.yt01"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.yt01.altinn.cloud"
        } -> null
      - id          = "correspondence/deploy-environments-yt01" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-yt01" -> null
          - namespace        = "correspondence" -> null
          - resource_version = "690773" -> null
          - uid              = "f79eef3c-4064-4c50-8f2d-80c91a41a8a7" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["dialogporten.at22"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at22.altinn.cloud"
        } -> null
      - id          = "dialogporten/deploy-environments-at22" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at22" -> null
          - namespace        = "dialogporten" -> null
          - resource_version = "690749" -> null
          - uid              = "3b0448dd-3303-4664-a9cd-e0bc11f0555f" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["dialogporten.at23"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at23.altinn.cloud"
        } -> null
      - id          = "dialogporten/deploy-environments-at23" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at23" -> null
          - namespace        = "dialogporten" -> null
          - resource_version = "690780" -> null
          - uid              = "e8610d17-a94c-48d4-8f6b-168494789931" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["dialogporten.at24"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at24.altinn.cloud"
        } -> null
      - id          = "dialogporten/deploy-environments-at24" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at24" -> null
          - namespace        = "dialogporten" -> null
          - resource_version = "690757" -> null
          - uid              = "afbf595b-9f91-4b12-9a16-b661c97cc310" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["dialogporten.prod"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.altinn.no"
        } -> null
      - id          = "dialogporten/deploy-environments-prod" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-prod" -> null
          - namespace        = "dialogporten" -> null
          - resource_version = "690764" -> null
          - uid              = "662f3352-8927-454e-ae4b-f0bd7eee03bf" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["dialogporten.tt02"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.tt02.altinn.no"
        } -> null
      - id          = "dialogporten/deploy-environments-tt02" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-tt02" -> null
          - namespace        = "dialogporten" -> null
          - resource_version = "690784" -> null
          - uid              = "5dfce83e-717d-4fec-aeda-c592ec69ae75" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["dialogporten.yt01"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.yt01.altinn.cloud"
        } -> null
      - id          = "dialogporten/deploy-environments-yt01" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-yt01" -> null
          - namespace        = "dialogporten" -> null
          - resource_version = "690800" -> null
          - uid              = "f295e114-c2fc-4d91-b8fe-7047d3a011f0" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["platform.at22"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at22.altinn.cloud"
        } -> null
      - id          = "platform/deploy-environments-at22" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at22" -> null
          - namespace        = "platform" -> null
          - resource_version = "690767" -> null
          - uid              = "9a03e567-f908-427d-8b03-f398e5f7afdb" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["platform.at23"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at23.altinn.cloud"
        } -> null
      - id          = "platform/deploy-environments-at23" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at23" -> null
          - namespace        = "platform" -> null
          - resource_version = "690756" -> null
          - uid              = "00ccf7ed-f2eb-4a9c-9505-968a26865017" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["platform.at24"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at24.altinn.cloud"
        } -> null
      - id          = "platform/deploy-environments-at24" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at24" -> null
          - namespace        = "platform" -> null
          - resource_version = "690782" -> null
          - uid              = "d6d535a5-d3d0-4a1c-9ab6-7d9b78e5655b" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["platform.prod"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.altinn.no"
        } -> null
      - id          = "platform/deploy-environments-prod" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-prod" -> null
          - namespace        = "platform" -> null
          - resource_version = "690779" -> null
          - uid              = "8fea22fa-1690-4530-85a3-4c71859f48ef" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["platform.tt02"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.tt02.altinn.no"
        } -> null
      - id          = "platform/deploy-environments-tt02" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-tt02" -> null
          - namespace        = "platform" -> null
          - resource_version = "690781" -> null
          - uid              = "157cd40a-e947-4ad7-959c-e51f0f4b120e" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["platform.yt01"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.yt01.altinn.cloud"
        } -> null
      - id          = "platform/deploy-environments-yt01" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-yt01" -> null
          - namespace        = "platform" -> null
          - resource_version = "690765" -> null
          - uid              = "5078b994-d21e-47b6-960d-ad689767e8aa" -> null
            # (1 unchanged attribute hidden)
        }
    }

Plan: 30 to add, 0 to change, 30 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @monteiro-renato |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/k6tests-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/k6tests-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_k6tests-rg.tfstate.tfplan`